---
kind: method
id: M:Autodesk.Revit.DB.WorksharingSaveAsOptions.#ctor
source: html/56c84ce4-6655-8ff2-aa55-461ed87145eb.htm
---
# Autodesk.Revit.DB.WorksharingSaveAsOptions.#ctor Method

Constructs a new WorksharingSaveAsOptions with default settings.

## Syntax (C#)
```csharp
public WorksharingSaveAsOptions()
```